app/controllers/articles_controller.rb

INSERT INTO "articles" ("title", "description", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "se va a borrar"], ["description", "se va a borrar todos los articles"], ["created_at", "2022-03-18 16:54:00.965667"], ["updated_at", "2022-03-18 16:54:00.965667"], ["user_id", 8]]
---
  def create
    @article = Article.new(article_params)
    @article.user = current_user
    if @article.save