app/controllers/users_controller.rb

    def show
      @articles = @user.articles.paginate(page: params[:page], per_page: 3)
---
SELECT "articles".* FROM "articles" WHERE "articles"."user_id" = ? LIMIT ? OFFSET ?  [["user_id", 2], ["LIMIT", 3], ["OFFSET", 0]]
SELECT COUNT(*) FROM "articles" WHERE "articles"."user_id" = ?  [["user_id", 2]]

    def index
      @users = User.paginate(page: params[:page], per_page: 3)
---
SELECT "users".* FROM "users"
SELECT COUNT(*) FROM "users"